{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v3.3.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "662"}, {"size": "64"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "41"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1838"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2048"}]}}}}, "modelTopology": {"node": [{"name": "unknown_29", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "41"}]}}}}}, {"name": "unknown_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "41"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/90/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/92/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/152_pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/155_pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/158_pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/161_pad/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/164_pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "unknown_12", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/167_pad/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/170_pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/173_pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_17", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "unknown_18", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/176_pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/179_pad/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "unknown_21", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/182_pad/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "unknown_23", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "2048"}]}}}}}, {"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/185_pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_25", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "2048"}, {"size": "2048"}]}}}}}, {"name": "unknown_26", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/model_z_10/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_z_10/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_27", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "2048"}]}}}}}, {"name": "unknown_31", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "1838"}]}}}}}, {"name": "unknown_32", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1838"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "662"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/90/transpose", "op": "Transpose", "input": ["input_1", "StatefulPartitionedCall/model_z_10/functional_55/90/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_z_10/functional_55/90/transpose", "StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/92/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3", "StatefulPartitionedCall/model_z_10/functional_55/92/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/152_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/92/transpose", "StatefulPartitionedCall/model_z_10/functional_55/152_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/152/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/152_pad/Pad", "unknown_3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/152/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/152/Conv2D", "unknown_4"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/95/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/152/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/155_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/95/Relu", "StatefulPartitionedCall/model_z_10/functional_55/155_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/155/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/155_pad/Pad", "unknown_5"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/155/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/155/Conv2D", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/98/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/155/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/100/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/model_z_10/functional_55/98/Relu"], "attr": {"ksize": {"list": {"i": ["1", "1", "2", "2"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "2", "2"]}}, "data_format": {"s": "TkNIVw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/158_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/100/AvgPool", "StatefulPartitionedCall/model_z_10/functional_55/158_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/158/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/158_pad/Pad", "unknown_7"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/158/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/158/Conv2D", "unknown_8"], "attr": {"data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/103/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/158/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/161_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/103/Relu", "StatefulPartitionedCall/model_z_10/functional_55/161_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/161/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/161_pad/Pad", "unknown_9"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/161/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/161/Conv2D", "unknown_10"], "attr": {"data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/106/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/161/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/108/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/model_z_10/functional_55/106/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "2", "2"]}}, "data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "1", "2", "2"]}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/164_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/108/AvgPool", "StatefulPartitionedCall/model_z_10/functional_55/164_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/164/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/164_pad/Pad", "unknown_11"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/164/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/164/Conv2D", "unknown_12"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/111/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/164/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/167_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/111/Relu", "StatefulPartitionedCall/model_z_10/functional_55/167_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/167/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/167_pad/Pad", "unknown_13"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/167/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/167/Conv2D", "unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/114/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/167/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/116/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/model_z_10/functional_55/114/Relu"], "attr": {"strides": {"list": {"i": ["1", "1", "2", "2"]}}, "ksize": {"list": {"i": ["1", "1", "2", "2"]}}, "data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/170_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/116/AvgPool", "StatefulPartitionedCall/model_z_10/functional_55/170_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/170/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/170_pad/Pad", "unknown_15"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/170/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/170/Conv2D", "unknown_16"], "attr": {"data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/119/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/170/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/173_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/119/Relu", "StatefulPartitionedCall/model_z_10/functional_55/173_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/173/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/173_pad/Pad", "unknown_17"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/173/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/173/Conv2D", "unknown_18"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/122/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/173/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/124/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/model_z_10/functional_55/122/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "1", "2", "2"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "2", "2"]}}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/176_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/124/AvgPool", "StatefulPartitionedCall/model_z_10/functional_55/176_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/176/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/176_pad/Pad", "unknown_19"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkNIVw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/176/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/176/Conv2D", "unknown_20"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/127/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/176/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/179_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/127/Relu", "StatefulPartitionedCall/model_z_10/functional_55/179_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/179/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/179_pad/Pad", "unknown_21"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/179/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/179/Conv2D", "unknown_22"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/130/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/179/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/132/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/model_z_10/functional_55/130/Relu"], "attr": {"data_format": {"s": "TkNIVw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "2", "2"]}}, "ksize": {"list": {"i": ["1", "1", "2", "2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/182_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/132/AvgPool", "StatefulPartitionedCall/model_z_10/functional_55/182_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/182/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/182_pad/Pad", "unknown_23"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/182/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/182/Conv2D", "unknown_24"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/135/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/182/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/185_pad/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_z_10/functional_55/135/Relu", "StatefulPartitionedCall/model_z_10/functional_55/185_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/185/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/model_z_10/functional_55/185_pad/Pad", "unknown_25"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkNIVw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/185/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_z_10/functional_55/185/Conv2D", "unknown_26"], "attr": {"data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/138/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/functional_55/185/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/140/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/model_z_10/functional_55/138/Relu"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_z_10/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_z_10/functional_55/140/AvgPool", "StatefulPartitionedCall/model_z_10/Mean/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/Max", "op": "Max", "input": ["StatefulPartitionedCall/model_z_10/Mean", "StatefulPartitionedCall/model_z_10/Max/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_z_10/Mean_1", "op": "Mean", "input": ["StatefulPartitionedCall/model_z_10/Mean", "StatefulPartitionedCall/model_z_10/Mean_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_z_10/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_z_10/Max", "StatefulPartitionedCall/model_z_10/Mean_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/dense_28/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_z_10/add", "unknown_27"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model_z_10/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_z_10/dense_28/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_z_10/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/dense_29/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_z_10/Relu", "unknown_29", "unknown_30"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_z_10/dense_30/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_z_10/Relu", "unknown_31", "unknown_32"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_z_10/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model_z_10/dense_29/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_z_10/softmax/Softmax_1", "op": "Softmax", "input": ["StatefulPartitionedCall/model_z_10/dense_30/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/model_z_10/softmax/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/model_z_10/softmax/Softmax_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of80.bin", "group1-shard2of80.bin", "group1-shard3of80.bin", "group1-shard4of80.bin", "group1-shard5of80.bin", "group1-shard6of80.bin", "group1-shard7of80.bin", "group1-shard8of80.bin", "group1-shard9of80.bin", "group1-shard10of80.bin", "group1-shard11of80.bin", "group1-shard12of80.bin", "group1-shard13of80.bin", "group1-shard14of80.bin", "group1-shard15of80.bin", "group1-shard16of80.bin", "group1-shard17of80.bin", "group1-shard18of80.bin", "group1-shard19of80.bin", "group1-shard20of80.bin", "group1-shard21of80.bin", "group1-shard22of80.bin", "group1-shard23of80.bin", "group1-shard24of80.bin", "group1-shard25of80.bin", "group1-shard26of80.bin", "group1-shard27of80.bin", "group1-shard28of80.bin", "group1-shard29of80.bin", "group1-shard30of80.bin", "group1-shard31of80.bin", "group1-shard32of80.bin", "group1-shard33of80.bin", "group1-shard34of80.bin", "group1-shard35of80.bin", "group1-shard36of80.bin", "group1-shard37of80.bin", "group1-shard38of80.bin", "group1-shard39of80.bin", "group1-shard40of80.bin", "group1-shard41of80.bin", "group1-shard42of80.bin", "group1-shard43of80.bin", "group1-shard44of80.bin", "group1-shard45of80.bin", "group1-shard46of80.bin", "group1-shard47of80.bin", "group1-shard48of80.bin", "group1-shard49of80.bin", "group1-shard50of80.bin", "group1-shard51of80.bin", "group1-shard52of80.bin", "group1-shard53of80.bin", "group1-shard54of80.bin", "group1-shard55of80.bin", "group1-shard56of80.bin", "group1-shard57of80.bin", "group1-shard58of80.bin", "group1-shard59of80.bin", "group1-shard60of80.bin", "group1-shard61of80.bin", "group1-shard62of80.bin", "group1-shard63of80.bin", "group1-shard64of80.bin", "group1-shard65of80.bin", "group1-shard66of80.bin", "group1-shard67of80.bin", "group1-shard68of80.bin", "group1-shard69of80.bin", "group1-shard70of80.bin", "group1-shard71of80.bin", "group1-shard72of80.bin", "group1-shard73of80.bin", "group1-shard74of80.bin", "group1-shard75of80.bin", "group1-shard76of80.bin", "group1-shard77of80.bin", "group1-shard78of80.bin", "group1-shard79of80.bin", "group1-shard80of80.bin"], "weights": [{"name": "unknown_29", "shape": [2048, 41], "dtype": "float32"}, {"name": "unknown_30", "shape": [41], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/90/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/92/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/152_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_3", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "unknown_4", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/155_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_5", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "unknown_6", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/158_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_7", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "unknown_8", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/161_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_9", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_10", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/164_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_11", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "unknown_12", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/167_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_13", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "unknown_14", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/170_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_15", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "unknown_16", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/173_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_17", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "unknown_18", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/176_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_19", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "unknown_20", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/179_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_21", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "unknown_22", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/182_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_23", "shape": [3, 3, 1024, 2048], "dtype": "float32"}, {"name": "unknown_24", "shape": [2048], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/185_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "unknown_25", "shape": [3, 3, 2048, 2048], "dtype": "float32"}, {"name": "unknown_26", "shape": [2048], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_z_10/Mean_1/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "unknown_27", "shape": [2048, 2048], "dtype": "float32"}, {"name": "unknown_31", "shape": [2048, 1838], "dtype": "float32"}, {"name": "unknown_32", "shape": [1838], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3/Offset", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_z_10/functional_55/91/FusedBatchNormV3/Scaled", "shape": [1, 64, 1, 1], "dtype": "float32"}]}]}