{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.3.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 662, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "Permute", "config": {"name": "90", "trainable": true, "dtype": "float32", "dims": [3, 2, 1]}, "name": "90", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "91", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "91", "inbound_nodes": [[["90", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "92", "trainable": true, "dtype": "float32", "dims": [3, 2, 1]}, "name": "92", "inbound_nodes": [[["91", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "152_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "152_pad", "inbound_nodes": [[["92", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "152", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "152", "inbound_nodes": [[["152_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "95", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "95", "inbound_nodes": [[["152", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "155_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "155_pad", "inbound_nodes": [[["95", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "155", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "155", "inbound_nodes": [[["155_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "98", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "98", "inbound_nodes": [[["155", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "99", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "99", "inbound_nodes": [[["98", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "100_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "100_pad", "inbound_nodes": [[["99", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "100", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "100", "inbound_nodes": [[["100_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "158_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "158_pad", "inbound_nodes": [[["100", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "158", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "158", "inbound_nodes": [[["158_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "103", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "103", "inbound_nodes": [[["158", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "161_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "161_pad", "inbound_nodes": [[["103", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "161", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "161", "inbound_nodes": [[["161_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "106", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "106", "inbound_nodes": [[["161", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "107", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "107", "inbound_nodes": [[["106", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "108_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "108_pad", "inbound_nodes": [[["107", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "108", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "108", "inbound_nodes": [[["108_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "164_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "164_pad", "inbound_nodes": [[["108", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "164", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "164", "inbound_nodes": [[["164_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "111", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "111", "inbound_nodes": [[["164", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "167_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "167_pad", "inbound_nodes": [[["111", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "167", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "167", "inbound_nodes": [[["167_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "114", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "114", "inbound_nodes": [[["167", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "115", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "115", "inbound_nodes": [[["114", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "116_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "116_pad", "inbound_nodes": [[["115", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "116", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "116", "inbound_nodes": [[["116_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "170_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "170_pad", "inbound_nodes": [[["116", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "170", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "170", "inbound_nodes": [[["170_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "119", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "119", "inbound_nodes": [[["170", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "173_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "173_pad", "inbound_nodes": [[["119", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "173", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "173", "inbound_nodes": [[["173_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "122", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "122", "inbound_nodes": [[["173", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "123", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "123", "inbound_nodes": [[["122", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "124_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "124_pad", "inbound_nodes": [[["123", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "124", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "124", "inbound_nodes": [[["124_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "176_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "176_pad", "inbound_nodes": [[["124", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "176", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "176", "inbound_nodes": [[["176_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "127", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "127", "inbound_nodes": [[["176", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "179_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "179_pad", "inbound_nodes": [[["127", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "179", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "179", "inbound_nodes": [[["179_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "130", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "130", "inbound_nodes": [[["179", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "131", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "131", "inbound_nodes": [[["130", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "132_pad", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "132_pad", "inbound_nodes": [[["131", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "132", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "132", "inbound_nodes": [[["132_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "182_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "182_pad", "inbound_nodes": [[["132", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "182", "trainable": true, "dtype": "float32", "filters": 2048, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "182", "inbound_nodes": [[["182_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "135", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "135", "inbound_nodes": [[["182", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "185_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "185_pad", "inbound_nodes": [[["135", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "185", "trainable": true, "dtype": "float32", "filters": 2048, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "185", "inbound_nodes": [[["185_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "138", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "138", "inbound_nodes": [[["185", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "139", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "name": "139", "inbound_nodes": [[["138", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "140", "trainable": true, "dtype": "float32", "pool_size": [1, 1], "padding": "same", "strides": [1, 1], "data_format": "channels_first"}, "name": "140", "inbound_nodes": [[["139", 0, 0, {}]]]}, {"class_name": "lambdaLayer", "config": {"name": "141", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAABAAAAAUAAABTAAAAcyYAAABkAWQAbABtAQIAAQBtAn0DAQB8A2oDfAB8AmQCawJ8\nAWQDjQNTACkETukAAAAA6QEAAAApAtoIa2VlcGRpbXPaBGF4aXMpBNoYdGVuc29yZmxvdy5rZXJh\ncy5iYWNrZW5k2gVrZXJhc9oHYmFja2VuZNoEbWVhbikE2gF4cgQAAAByAwAAANoBS6kAcgsAAAD6\nUy9ob21lL3Njcm8zNTE3L2FuYWNvbmRhMy9saWIvcHl0aG9uMy43L3NpdGUtcGFja2FnZXMvb25u\neDJrZXJhcy9vcGVyYXRpb25fbGF5ZXJzLnB52gx0YXJnZXRfbGF5ZXKJAAAAcwQAAAAAARIB\n", [[3], 0], null], "function_type": "lambda", "module": "onnx2keras.operation_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "141", "inbound_nodes": [[["140", 0, 0, {}]]]}, {"class_name": "lambdaLayer", "config": {"name": "142", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAABAAAAAUAAABTAAAAcyYAAABkAWQAbABtAQIAAQBtAn0DAQB8A2oDfAB8AmQCawJ8\nAWQDjQNTACkETukAAAAA6QEAAAApAtoIa2VlcGRpbXPaBGF4aXMpBNoYdGVuc29yZmxvdy5rZXJh\ncy5iYWNrZW5k2gVrZXJhc9oHYmFja2VuZNoDbWF4KQTaAXhyBAAAAHIDAAAA2gFLqQByCwAAAPpT\nL2hvbWUvc2NybzM1MTcvYW5hY29uZGEzL2xpYi9weXRob24zLjcvc2l0ZS1wYWNrYWdlcy9vbm54\nMmtlcmFzL29wZXJhdGlvbl9sYXllcnMucHnaDHRhcmdldF9sYXllcqMAAABzBAAAAAABEgE=\n", [[2], 0], null], "function_type": "lambda", "module": "onnx2keras.operation_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "142", "inbound_nodes": [[["141", 0, 0, {}]]]}, {"class_name": "lambdaLayer", "config": {"name": "143", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAABAAAAAUAAABTAAAAcyYAAABkAWQAbABtAQIAAQBtAn0DAQB8A2oDfAB8AmQCawJ8\nAWQDjQNTACkETukAAAAA6QEAAAApAtoIa2VlcGRpbXPaBGF4aXMpBNoYdGVuc29yZmxvdy5rZXJh\ncy5iYWNrZW5k2gVrZXJhc9oHYmFja2VuZNoEbWVhbikE2gF4cgQAAAByAwAAANoBS6kAcgsAAAD6\nUy9ob21lL3Njcm8zNTE3L2FuYWNvbmRhMy9saWIvcHl0aG9uMy43L3NpdGUtcGFja2FnZXMvb25u\neDJrZXJhcy9vcGVyYXRpb25fbGF5ZXJzLnB52gx0YXJnZXRfbGF5ZXKJAAAAcwQAAAAAARIB\n", [[2], 0], null], "function_type": "lambda", "module": "onnx2keras.operation_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "143", "inbound_nodes": [[["141", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "144", "trainable": true, "dtype": "float32"}, "name": "144", "inbound_nodes": [[["142", 0, 0, {}], ["143", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "145", "trainable": true, "dtype": "float32", "units": 2048, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "145", "inbound_nodes": [[["144", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "146", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "146", "inbound_nodes": [[["145", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "output_0", "inbound_nodes": [[["146", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "148", "trainable": true, "dtype": "float32", "units": 41, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "148", "inbound_nodes": [[["output_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "149", "trainable": true, "dtype": "float32", "units": 1838, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "149", "inbound_nodes": [[["output_0", 0, 0, {}]]]}, {"class_name": "lambdaLayer", "config": {"name": "output_1", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAwAAAAQAAABTAAAAcxgAAABkAWQAbAB9AnwCagFqAnwAfAFkAo0CUwApA07pAAAA\nACkB2gRheGlzKQPaCnRlbnNvcmZsb3faAm5u2gdzb2Z0bWF4KQPaAXhyAgAAANoCdGapAHIIAAAA\n+lQvaG9tZS9zY3JvMzUxNy9hbmFjb25kYTMvbGliL3B5dGhvbjMuNy9zaXRlLXBhY2thZ2VzL29u\nbngya2VyYXMvYWN0aXZhdGlvbl9sYXllcnMucHnaDHRhcmdldF9sYXllcpAAAABzBAAAAAABCAE=\n", [1], null], "function_type": "lambda", "module": "onnx2keras.activation_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "output_1", "inbound_nodes": [[["148", 0, 0, {}]]]}, {"class_name": "lambdaLayer", "config": {"name": "output_2", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAwAAAAQAAABTAAAAcxgAAABkAWQAbAB9AnwCagFqAnwAfAFkAo0CUwApA07pAAAA\nACkB2gRheGlzKQPaCnRlbnNvcmZsb3faAm5u2gdzb2Z0bWF4KQPaAXhyAgAAANoCdGapAHIIAAAA\n+lQvaG9tZS9zY3JvMzUxNy9hbmFjb25kYTMvbGliL3B5dGhvbjMuNy9zaXRlLXBhY2thZ2VzL29u\nbngya2VyYXMvYWN0aXZhdGlvbl9sYXllcnMucHnaDHRhcmdldF9sYXllcpAAAABzBAAAAAABCAE=\n", [1], null], "function_type": "lambda", "module": "onnx2keras.activation_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "output_2", "inbound_nodes": [[["149", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0], ["output_1", 0, 0], ["output_2", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of80.bin", "group1-shard2of80.bin", "group1-shard3of80.bin", "group1-shard4of80.bin", "group1-shard5of80.bin", "group1-shard6of80.bin", "group1-shard7of80.bin", "group1-shard8of80.bin", "group1-shard9of80.bin", "group1-shard10of80.bin", "group1-shard11of80.bin", "group1-shard12of80.bin", "group1-shard13of80.bin", "group1-shard14of80.bin", "group1-shard15of80.bin", "group1-shard16of80.bin", "group1-shard17of80.bin", "group1-shard18of80.bin", "group1-shard19of80.bin", "group1-shard20of80.bin", "group1-shard21of80.bin", "group1-shard22of80.bin", "group1-shard23of80.bin", "group1-shard24of80.bin", "group1-shard25of80.bin", "group1-shard26of80.bin", "group1-shard27of80.bin", "group1-shard28of80.bin", "group1-shard29of80.bin", "group1-shard30of80.bin", "group1-shard31of80.bin", "group1-shard32of80.bin", "group1-shard33of80.bin", "group1-shard34of80.bin", "group1-shard35of80.bin", "group1-shard36of80.bin", "group1-shard37of80.bin", "group1-shard38of80.bin", "group1-shard39of80.bin", "group1-shard40of80.bin", "group1-shard41of80.bin", "group1-shard42of80.bin", "group1-shard43of80.bin", "group1-shard44of80.bin", "group1-shard45of80.bin", "group1-shard46of80.bin", "group1-shard47of80.bin", "group1-shard48of80.bin", "group1-shard49of80.bin", "group1-shard50of80.bin", "group1-shard51of80.bin", "group1-shard52of80.bin", "group1-shard53of80.bin", "group1-shard54of80.bin", "group1-shard55of80.bin", "group1-shard56of80.bin", "group1-shard57of80.bin", "group1-shard58of80.bin", "group1-shard59of80.bin", "group1-shard60of80.bin", "group1-shard61of80.bin", "group1-shard62of80.bin", "group1-shard63of80.bin", "group1-shard64of80.bin", "group1-shard65of80.bin", "group1-shard66of80.bin", "group1-shard67of80.bin", "group1-shard68of80.bin", "group1-shard69of80.bin", "group1-shard70of80.bin", "group1-shard71of80.bin", "group1-shard72of80.bin", "group1-shard73of80.bin", "group1-shard74of80.bin", "group1-shard75of80.bin", "group1-shard76of80.bin", "group1-shard77of80.bin", "group1-shard78of80.bin", "group1-shard79of80.bin", "group1-shard80of80.bin"], "weights": [{"name": "145/kernel", "shape": [2048, 2048], "dtype": "float32"}, {"name": "145/bias", "shape": [2048], "dtype": "float32"}, {"name": "148/kernel", "shape": [2048, 41], "dtype": "float32"}, {"name": "148/bias", "shape": [41], "dtype": "float32"}, {"name": "149/kernel", "shape": [2048, 1838], "dtype": "float32"}, {"name": "149/bias", "shape": [1838], "dtype": "float32"}, {"name": "152/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "152/bias", "shape": [64], "dtype": "float32"}, {"name": "155/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "155/bias", "shape": [64], "dtype": "float32"}, {"name": "158/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "158/bias", "shape": [128], "dtype": "float32"}, {"name": "161/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "161/bias", "shape": [128], "dtype": "float32"}, {"name": "164/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "164/bias", "shape": [256], "dtype": "float32"}, {"name": "167/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "167/bias", "shape": [256], "dtype": "float32"}, {"name": "170/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "170/bias", "shape": [512], "dtype": "float32"}, {"name": "173/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "173/bias", "shape": [512], "dtype": "float32"}, {"name": "176/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "176/bias", "shape": [1024], "dtype": "float32"}, {"name": "179/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "179/bias", "shape": [1024], "dtype": "float32"}, {"name": "182/kernel", "shape": [3, 3, 1024, 2048], "dtype": "float32"}, {"name": "182/bias", "shape": [2048], "dtype": "float32"}, {"name": "185/kernel", "shape": [3, 3, 2048, 2048], "dtype": "float32"}, {"name": "185/bias", "shape": [2048], "dtype": "float32"}, {"name": "91/gamma", "shape": [64], "dtype": "float32"}, {"name": "91/beta", "shape": [64], "dtype": "float32"}, {"name": "91/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "91/moving_variance", "shape": [64], "dtype": "float32"}]}]}
